<?php
include __DIR__ . '/functions.php';

$a = false;
$b = 4;
$c = 1;

$d = discriminant($a, $b, $c);

if ($d < 0) {
    echo 'Дискриминант равен: ' . $d . '! Уравнение не имеет корней!';
} elseif (0 === $d) {
    $x = -$b / (2 * $a);
    echo 'Дискриминант равен: ' . $d . '! Корень уравнения: ' . $x;
} elseif ($d > 0) {
    $x1 = (-$b + sqrt($d)) / (2 * $a);
    $x2 = (-$b - sqrt($d)) / (2 * $a);
    echo 'Дискриминант равен: ' . $d; ?> <br> <?php
    echo '! Первый корень: ' . $x1; ?> <br> <?php
    echo '! Второй корень: ' . $x2;
} elseif (null === $d){
    echo 'Значение а равно 0! Уравнение неквадратное!';
}